firefoxforgood-sprint-title = Конкурс «Firefox для хорошего»
firefoxforgood-sprint-description = Представьте себе Интернет, в котором нет бесконечного потока рекламы, фальшивых новостей, ненависти и ядовитых социальных сетей. Место, где легко найти значимый и заслуживающий доверия контент. Место, где каждый чувствует себя в безопасности и точно информирован. Как браузер может увеличить количество достоверного и качественного контента и общения?
firefoxforgood-sprint-duration = 11 июня - 9 июля 2019 г.
firefox-preview-respond-sprint-duration = 13 ноября - 2 декабря 2019 г.
