Repository: mozilla/activate.mozilla.community
Catalog: locales/*/faq.xlf
Languages: es_es

source: layout: default title: "Frequently Asked Questions" permalink: /faq/ lang: en
es_es: layout: default title: "Preguntas más frecuentes" permalink: /es/faq/ lang: en

source: Frequently Asked Questions
es_es: Preguntas más frecuentes

source: What is Activate Mozilla?
es_es: ¿Qué es Actívate en Mozilla?

source: Activate Mozilla is a campaign for Mozillians around the world to have impact in areas key to Mozilla’s mission.
es_es: Actívate en Mozilla es una campaña para Mozillians de todo el mundo, para que puedan tener un impacto en áreas claves para la misión de Mozilla.

source: We want to bring more clarity on what are the most important areas to contribute to at Mozilla right now, and provide clear steps on how to get involved right away.
es_es: Queremos ser claros sobre cuáles son las áreas más importantes de Mozilla en las que colaborar ahora mismo y ofrecer instrucciones específicas sobre cómo colaborar.

source: These will be presented in the form of activities.
es_es: Se presentarán en forma de actividades.

source: Who can be involved in the activities?
es_es: ¿Quién puede participar en las actividades?

source: Anyone who wants to support Mozilla.
es_es: Cualquiera que quiera colaborar con Mozilla.

source: How do I get involved?
es_es: ¿Cómo puedo colaborar?

source: Just navigate the site and read the different areas and activities described.
es_es: Navega por la página y lee la descripción de las diferentes áreas y actividades.

source: There you will find more information on why the activities have been chosen, and concrete instructions on how to contribute to each of them.
es_es: Ahí encontrarás más información sobre por qué hemos elegido esas actividades e instrucciones específicas sobre cómo colaborar en ellas.

source: Why should I get involved?
es_es: ¿Por qué debería colaborar?

source: The areas and activity described in this site are a result of a joint effort from the Mozilla Participation team and other teams to surface what is imporant for the organization right now.
es_es: Las áreas y actividades que se describen en esta página son el resultado de un esfuerzo común entre el equipo de Participación de Mozilla y otros equipos para resaltar qué es lo más importante ahora mismo en términos de organización.

source: If you want to support Mozilla and you are unsure about what to do, this campaign is for you.
es_es: Si quieres apoyar a Mozilla y no sabes cómo, esta campaña es para ti.

source: What are the goals of the campaign?
es_es: ¿Cuáles son los objetivos de la campaña?

source: The primary goal of the campaign is to launch activities that bring value everyone participating, from community mobilizers, to event attendees, to teams at Mozilla.
es_es: El objetivo principal es lanzar actividades que aporten valores a todos los colaboradores, desde movilizando comunidades hasta asistiendo a eventos y participando en equipos de Mozilla.

source: We have set ourselves targets for Q3 (July-September), 2016.
es_es: Nos hemos impuestos unos objetivos para el Q3 (julio-septiembre) de 2016.

source: While they are not arbitrary numbers, they are meant to be aspirational and not exact.
es_es: Aunque no son números aleatorios, están ahí para inspirar, no para ser exactos.

source: 6 activities are launched.
es_es: Se han lanzado 6 actividades.

source: 400 mobilizers activated.
es_es: Se ha movilizado a 400 personas.

source: Primarily this is people organising events, assisting in logistics, and being the primary driver of an activity to bring more contributions.
es_es: Se trata sobre todo de organizadores de eventos, gente que ayuda en la logística y de ser el conductor principal de una actividad que tiene como objetivo atraer más colaboraciones.

source: 3500 unique contributions to the campaign.
es_es: 3500 colaboraciónes a la campaña.

source: These are the people mobilized, such as those attending events, installing add-ons, and so on.
es_es: Esta es la gente a la que hemos movilizado: desde los que asisten a eventos hasta los que instalan complementos, etc.

source: 2000 social shares of campaign activities.
es_es: Las actividades de la campaña se han compartido 2000 veces en las redes sociales.

source: These are listed here for transparency, and you can also see our per-activity goals listed under the 'Goals for this area' section on each activity page.
es_es: Aparecen aquí por cuestiones de transparencia y, en la sección 'Objetivos para este área' en la página de cada actividad, podrás ver nuestros objetivos pre-actividad.

source: What should I do if I have questions?
es_es: ¿Qué hago si tengo alguna duda?

source: You can ask directly creating a new topic at the [Participation Leaders forum](https://discourse.mozilla-community.org/c/participation-leaders).
es_es: Puedes preguntar directamente abriendo un nuevo tema en el [foro de los líderes de participación](https://discourse.mozilla-community.org/c/participation-leaders).

source: Can I request budget or swag for these activities?
es_es: ¿Puedo solicitar un presupuesto para estas actividades?

source: We encourage you to run these as lean as possible, but realise that sometimes there can be some costs incurred for logistics or refreshments.
es_es: Te animamos a que seas lo más austero posible, pero sabemos que a veces pueden surgir gastos para temas logísticos o refrigerios.

source: If your event meets the requirements laid out in the activity, there is a fund available of up to $150 USD per event.
es_es: Si tu evento cumple con los requisitos detallados en la actividad, existe un fondo disponible de hasta 150 USD por evento.

source: This can be used for only the following items/services:
es_es: Este fondo se puede utilizar para cubrir los siguientes elementos/services:

source: Locally produced stickers and/or other small items (only for an event for over 50 people)
es_es: Stickers fabricados de forma local y/u otros pequeños elementos (solo para eventos de más de 50 personas)

source: Food for participants for an event over than 5 hours
es_es: Comida para los participantes de un evento de más de 5 horas

source: Venue rental (in the case of the no other alternative)
es_es: Alquiler del espacio (si no existen otras alternativas)

source: Travel for expert on the field (currently allowed only for Rust events)
es_es: Gastos de viaje para los expertos en la materia (ya se permite en los eventos de Rust)

source: For some activities, extra budget is available for special needs.
es_es: Para algunas actividades existe un presupuesto adicional para cubrir necesidades especiales.

source: For example, VR headsets for the WebVR Camp activity.
es_es: Por ejemplo, auriculares VR para la actividad WebVR Camp.

source: Details will be available on the relevant activity pages.
es_es: Encontrarás más detalles en la página de cada actividad.

source: Assets to use will be included in some activities.
es_es: En algunas actividades se incluirán los recursos que se pueden utilizar.

source: Unless explicitly mentioned in the activity, there will be no other swag available for the campaign.
es_es: Excepto si se menciona de forma explícita, no hay un presupuesto disponible para la campaña.

source: To make the request, you will need to make a Reps budget request.
es_es: Para solicitarlo, tendrás que enviar una solicitud de presupuesto a Reps.

source: If you are not a Rep, please contact a local Rep to help you.
es_es: Si no eres Rep, ponte en contacto con alguien de tu zona que pueda ayudarte.

source: We will fast-track valid requests, which are ones that meet the requirements of the activity.
es_es: Se aceptarán rápidamente las solicitudes válidas, que son aquellas que cumplan con los requisitos de la actividad.

source: For larger budget requests, it will be processed like any other Reps budget request and there is no guarantee it will be approved and even if so, whether it will be on time.
es_es: Si se trata de una solicitud para un presupuesto mayor, se tratará de la misma forma que las solicitudes de Reps y no podemos garantizar que sean aprobadas (e incluso si se aprueban, que se haga a tiempo).
