Repository: mozilla/activate.mozilla.community
Catalog: locales/*/participation.xlf
Languages: pt_br

source: layout: default title: "Participation" permalink: /participation/ lang: en
pt_br: layout: default title: "Participation" permalink: /pt/participation/ lang: en

source: About Participation at Mozilla
pt_br: Sobre a participação da Mozilla

source: Mozilla has thousands of volunteers globally making an impact every day by contributing to engineering projects, localization, support, marketing, and other areas.
pt_br: A Mozilla tem milhares de voluntários em todo o Mundo, que impactam todos os dias ao contribuírem com projetos de engenharia, localização, suporte, marketing e outras áreas.

source: However, sometimes finding the right opportunity to help at the right time can be difficult in a project so large.
pt_br: No entanto, às vezes, encontrar a oportunidade certa para ajudar na hora certa pode ser difícil em um projeto tão grande.

source: Hence the creation of this site, the purpose of which is to surface up things to do right now.
pt_br: Por isso, a criação deste site, cujo objetivo é mostrar as coisas que há para fazer neste momento.

source: The criteria for these activities are:
pt_br: Os critérios para essas atividades são:

source: They are relevant to what is happening right now at Mozilla
pt_br: Elas são relevantes para o que está acontecendo neste momento na Mozilla

source: They bring value to those who choose to participate
pt_br: Elas trazem valor para aqueles que escolheram participar

source: They appeal to a broad group of people
pt_br: Elas têm apelo para um amplo grupo de pessoas

source: They are self-serve and require no support to get up and running
pt_br: Elas são autoaplicáveis e não requerem nenhum apoio para se iniciar e executar

source: The goal is simple, Participation at scale with impact.
pt_br: O objetivo é simples: Participação em escala com impacto.

source: Help us get bigger and better, as we continue to carry out our mission.
pt_br: Ajude-nos a ser maiores e melhores, enquanto continuamos a realizar a nossa missão.

source: Our Mission
pt_br: Nosso objetivo

source: To have Mozilla succeed through openness and participation
pt_br: O sucesso da Mozilla por meio da abertura e participação.

source: What We Do
pt_br: O que nós fazemos

source: The Participation Team develops community leaders and contributors who will invent, shape and defend the Internet, and activates them to supercharge Mozilla’s products and our movement.
pt_br: A Equipe de Participação desenvolve líderes comunitários e colaboradores que irão inventar, formar e defender a Internet, e ativa-os para turbinar o nosso movimento e os produtos da Mozilla.

source: We do this by:
pt_br: Fazemos isso:

source: Designing and implementing specific participation initiatives -- in partnership with teams around Mozilla -- that adapt and advance global best-practice on participation
pt_br: Projetando e implementando iniciativas específicas de participação -- em parceria com outras equipes da Mozilla -- que se adaptam e promovem as melhores práticas globais em participação.

source: Recruiting and investing in core contributors mobilizers/leaders, and developing diverse, local and global communities that make individual contribution more impactful
pt_br: Recrutando e investindo nos principais colaboradores mobilizadores/líderes, e desenvolvendo diversas, locais e globais comunidades que fazem a contribuição individual mais impactante

source: Delivering software/systems and practices that increase the impact of participation across Mozilla
pt_br: Fornecendo software/sistemas e práticas que aumentam o impacto da participação em toda a Mozilla

source: Get Involved
pt_br: Se envolva

source: Find out more on the [Participation Wiki](https://wiki.mozilla.org/Participation).
pt_br: Saiba mais em nossa página da [Wiki Participation](https://wiki.mozilla.org/Participation) (em inglês).
