Repository: mozilla/activate.mozilla.community
Catalog: locales/*/rust-hack.xlf
Languages: pt_br

source: layout: page title: "Dive Into Rust" permalink: /rust-hack/ lang: en ref: rust-hack parent: activities
pt_br: layout: page title: "Mergulhando no Rust" permalink: /pt/rust-hack/ lang: en ref: rust-hack parent: activities

source: redirect_from: "/developer-engagement/rust-hack/"
pt_br: redirect_from: "/pt/developer-engagement/rust-hack/"

source: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 2-3 hours
pt_br: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 2-3 horas

source: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> Having more developers understand, use and evangelize this language will advance make the web better and more secure.
pt_br: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> Quanto mais desenvolvedores entenderem, utilizarem e evangelizarem Rust, mais ela irá crescer e tornar a Web melhor e mais segura.

source: Rust is a systems programming language that runs blazingly fast, prevents segfaults, and guarantees thread safety.
pt_br: Rust é uma linguagem de programação de sistemas que roda extremamente rápido, evita falhas da segurança, e garante a segurança dos processos do sistema.

source: [Find out more...](https://www.rust-lang.org)
pt_br: [Encontre mais em...](https://www.rust-lang.org)

source: Impact and Metrics
pt_br: Impacto e Métricas

source: The Rust programming language will be important to the future of the web, making it safe and great.
pt_br: A linguagem de programação Rust será importante para o futuro da Web, tornando-a segura e melhor.

source: Having more developers understand, use and evangelize this language will advance make the web better and more secure.
pt_br: Tendo mais desenvolvedores entendendo, usando e evangelizando essa linguagem vai avançar fazendo a web melhor e mais segura.

source: Rust will also be used extensively for Mozilla projects -- including this year as Servo (written in Rust) is advanced even further, and parts of it are moved into Gecko/Firefox.
pt_br: Rust também vai ser usada extensivamente nos projetos da Mozilla -- como por exemplo, este ano o Servo (escrito em Rust) avançou ainda mais, e partes dele foram incluidas no Gecko/Firefox.

source: Having more Mozilla contributors know Rust will give them a chance to contribute to the most exciting and important technical projects coming up for Mozilla.
pt_br: Quanto mais colaboradores da Mozilla souberem Rust mais oportunidades de contribuir para os projetos técnicos importantes que estão aparecendo elas terão.

source: Goals for this area
pt_br: Metas para esta área

source: 1,000 programmers/developers are introduced to and are well on their way to learning Rust
pt_br: 1,000 programadores/desenvolvedores sendo introduzidos e estão bem em suas formas de aprender Rust

source: 10 blog posts about events or other local Rust activities
pt_br: 10 posts de blogs sobre eventos ou outros locais de atividades Rust

source: 50 Mozillians organize Rust Hack and Learn events
pt_br: 50 Mozillians organizando eventos Rust Hack e de aprendizagem

source: 50 new people signed up to [Rust developer list](https://users.rust-lang.org)
pt_br: 50 novas pessoas registradas na [lista de desenvolvedores Rust](https://users.rust-lang.org)

source: Audience for this activity
pt_br: Público para esta atividade

source: Your audience for this event should be **programmers and developers**.
pt_br: Seu público para este evento deve ser **programadores e desenvolvedores**.

source: Focus on people who are technical and already know languages like C or Python or other similar languages.
pt_br: Concentre-se em pessoas que são técnicas e já conhecem linguagens como C ou Python ou outras linguagens semelhantes.

source: Activity Format
pt_br: Formato de Atividade

source: Get your community behind this exciting new programming language by running a learning event.
pt_br: Apresente a sua comunidade esta nova e excitante linguagem de programação, um evento de aprendizagem.

source: Put an event team together
pt_br: Organize uma equipe de eventos

source: Choose a date and secure a venue
pt_br: Escolha uma data e um local

source: Choose whether this will be self-facilitated or with someone who has Rust experience (see below)
pt_br: Escolha se será um evento auto-aprendizagem ou com alguém que tem experiência com Rust (ver abaixo)

source: Setup the event on Reps Portal ([instructions](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting))
pt_br: Registre o evento no Portal Reps ([instruções](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting))

source: For duration, we recommend a half-day (or full evening) event with a minimum of 15-25 attendees.
pt_br: Sobre a duração, é recomendamos um meio-dia (ou noite inteira) e,vento com um mínimo de 15-25 participantes.

source: There are two options for facilitation:
pt_br: Existem duas opções para a facilitação:

source: Ask a person with experience with Rust to attend and provide guidance to attendees.
pt_br: Peça a uma pessoa com experiência com Rust para apresentar e fornecer orientações aos participantes.

source: There are a few ways to try to find local Rust experts to invite:
pt_br: Existem algumas maneiras de tentar encontrar especialistas em Rust locais para convidar:

source: Reach out to the [Community Team](https://www.rust-lang.org/en-US/team.html#Community-team) - community-team [at] rust-lang [dot] org - they know the most active people in most regions.
pt_br: Entre em contato com o [Time da Comunidade](https://www.rust-lang.org/en-US/team.html#Community-team) - community-time [arroba] rust-lang [ponto] org - eles conhecem as pessoas mais ativas na maioria das regiões.

source: Via the [user groups](https://www.rust-lang.org/en-US/user-groups.html)
pt_br: Através do [grupo de usuários](https://www.rust-lang.org/en-US/user-groups.html)

source: At [rustaceans.org](http://www.rustaceans.org/)
pt_br: No [rustaceans.org](http://www.rustaceans.org/)

source: If the facilitators have little or no Rust experience, turn it into a learning session for everyone, where you go through the steps together.
pt_br: Se os facilitadores têm pouca ou nenhuma experiência com Rust, transforme o evento em uma sessão de aprendizagem para todos, passando pelas etapas em conjunto.

source: Some Mozillians have already done such sessions.
pt_br: Alguns Mozillians já fizeram tais sessões.

source: For example our [Community Spaces](https://wiki.mozilla.org/Participation/Community_Spaces) have, so you can reach out the them to ask for some guidance.
pt_br: Por exemplo, nosso espaço da [comunidade tem](https://wiki.mozilla.org/Participation/Community_Spaces), para que possa chegar a eles para pedir alguma orientação.

source: Event Flow
pt_br: Fluxo de Eventos

source: Install Rust
pt_br: Instalar Rust

source: [rustup](https://www.rustup.rs) - recommended
pt_br: [rustup](https://www.rustup.rs) - recomendado

source: [Rust downloads](https://www.rust-lang.org/downloads.html) (alternative)
pt_br: [Download do Rust](https://www.rust-lang.org/downloads.html) (alternativo)

source: Read the [Rust book](https://doc.rust-lang.org/stable/book/)
pt_br: Leia o [livro do Rust](https://doc.rust-lang.org/stable/book/)

source: Complete the [Rustlings](https://github.com/carols10cents/rustlings) (a great beginners course!)
pt_br: Faça o [Rustlings](https://github.com/carols10cents/rustlings) (um ótimo curso para iniciantes!)

source: Some projects with great first bugs:
pt_br: Alguns projetos com falhas e erros para resolver e praticar o que aprendeu:

source: The Rust language and compiler
pt_br: A linguagem Rust e compilador

source: [Labeled easy](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AE-easy)
pt_br: [Problemas fáceis](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AE-easy)

source: [Labeled mentor](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AE-mentor)
pt_br: [Problemas com mentores](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AE-mentor)

source: [clippy - the popular Rust static analysis tool](https://github.com/Manishearth/rust-clippy)
pt_br: [clippy - ferramenta de análise estática do Rust](https://github.com/Manishearth/rust-clippy)

source: [Cargo - Rust’s package manager](https://github.com/rust-lang/cargo/issues?q=is%3Aopen+is%3Aissue+label%3AE-easy)
pt_br: [Cargo - gerenciador de pacotes do Rust](https://github.com/rust-lang/cargo/issues?q=is%3Aopen+is%3Aissue+label%3AE-easy)

source: [rustfmt - the Rust source code formatting tool](https://github.com/rust-lang-nursery/rustfmt/issues)
pt_br: [rustfmt - ferramenta de formatação de código-fonte do Rust](https://github.com/rust-lang-nursery/rustfmt/issues)

source: Though some are without clear instructions, the domain is easy to understand (it's mostly manipulating strings), and potentially engaging.
pt_br: Embora alguns não tenham instruções claras, o objetivo é fácil de entender (são principalmente manipulação de strings), e são super atraentes.

source: [rustup - the Rust installer](https://github.com/rust-lang-nursery/rustup.rs/issues?q=is%3Aopen+is%3Aissue+label%3A%22help+wanted%22)
pt_br: [rustup - o instalador Rust](https://github.com/rust-lang-nursery/rustup.rs/issues?q=is%3Aopen+is%3Aissue+label%3A%22help+wanted%22)

source: Rust documentation
pt_br: Documentação Rust

source: [Labeled easy](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AA-docs+label%3AE-easy)
pt_br: [Problemas fáceis](https://github.com/rust-lang/rust/issues?q=is%3Aopen+is%3Aissue+label%3AA-docs+label%3AE-easy)

source: [Standard library API docs](https://github.com/rust-lang/rust/issues/29329)
pt_br: [Documentação sobre API da biblioteca padrão](https://github.com/rust-lang/rust/issues/29329)

source: [This Week in Rust](https://this-week-in-rust.org/) also publishes a call for participation each week with hot contribution ideas.
pt_br: [Semana do Rust](https://this-week-in-rust.org/) também publica uma chamada para a participação em cada semana com ideias de contribuições importantes.

source: Other Resources
pt_br: Outros recursos

source: Tutorials
pt_br: Tutoriais

source: [Niko Matsakis's excellent slide deck](https://github.com/nikomatsakis/rust-tutorials-keynote)
pt_br: [Slide deck excelente do Niko Matsakis](https://github.com/nikomatsakis/rust-tutorials-keynote)

source: [Exercises to accompany that deck](https://github.com/nikomatsakis/rust-tutorializer)
pt_br: [Exercícios para acompanhar o slide deck](https://github.com/nikomatsakis/rust-tutorializer)

source: [A screencast from Niko on ownership and borrowing](https://www.youtube.com/watch?v=TCUBSbJENO4)
pt_br: [Apresentação do Niko sobre ownership e borrowing](https://www.youtube.com/watch?v=TCUBSbJENO4)

source: Output
pt_br: Pós-evento

source: Additional to the recommended event flow here are some things we’d like you, the event organizer, to do.
pt_br: Para você organizador, temos mais algumas dicas e coisas que gostaríamos que fizesse.

source: Fill out the post-event metrics on the event page you setup on the Reps portal
pt_br: Preencha as métricas pós-evento na página do evento você configurar no portal Reps

source: Optionally, tell us about your event.
pt_br: Opcionalmente, conte-nos sobre o seu evento.

source: This can be before or after.
pt_br: Isto pode ser antes ou depois.

source: We love to hear about upcoming plans, and of course love to hear about what was achieved at the event with a picture or two!
pt_br: Gostamos de ouvir sobre os próximos planos, e claro, adoramos ouvir sobre como foi o evento com uma foto ou duas!

source: This will also be instructional and inspirational to others who might do the event.
pt_br: Isto servirá de instrução e inspiração para outras pessoas que podem fazer o evento.

source: [Here is the Discourse post to write to](https://discourse.mozilla-community.org/t/activate-mozilla-dive-into-rust/10073/1)
pt_br: [Aqui está o tópico no Discourse para informar sobre o evento](https://discourse.mozilla-community.org/t/activate-mozilla-dive-into-rust/10073/1)

source: While the focus of this activity should be on these events, there are other ways to stay more involved with the Rust community after.
pt_br: Embora o foco desta atividade deve ser sobre estes eventos, existem outras formas de se envolver mais com a comunidade Rust depois.

source: Follow up with attendees to highlight [more things happening in the community to get involved with](https://www.rust-lang.org/en-US/community.html)
pt_br: Acompanhe os participantes para saber [as coisas que estão acontecendo na comunidade a se envolver](https://www.rust-lang.org/en-US/community.html)
