Repository: mozilla/activate.mozilla.community
Catalog: locales/*/test-pilot.xlf
Languages: pt_br

source: layout: page title: "Install Test Pilot" permalink: /test-pilot/ lang: en ref: test-pilot parent: activities
pt_br: layout: page title: "Install Test Pilot" permalink: /pt/test-pilot/ lang: en ref: test-pilot parent: activities

source: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> By testing new features and functionality, you help to keep Firefox on the leading edge and consumers engaged in our product.
pt_br: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> Ao testar novos recursos e funcionalides, você ajuda a manter o Firefox na linha de frente e os usuários com nosso produto.

source: When building features for hundreds of millions of Firefox users worldwide, it’s important to get them right.
pt_br: Ao construir funcionalidades para centenas de milhões de usuários do Firefox ao redor do mundo, é importante fazer do jeito certo.

source: To help figure out which features should ship and how they should work, we created the new Test Pilot program.
pt_br: Para ajudar a descobrir quais funcionalidades devem ser entregues e como devem funcionar, nós criamos o novo programa Test Pilot.

source: Test Pilot is a way for you to try out experimental features and let us know what you think.
pt_br: O Test Pilot é a maneira para você experimentar as funcionalidades e nos dizer o que achou.

source: You can turn them on and off at any time, and you’ll always know what information you’re sharing to help us understand how these features are used.
pt_br: Você pode ativá-lo e desativá-lo a qualquer momento, e você sempre saberá que informação você está compartilhando para nos ajudar a entender como essas funcionalidades são utilizadas.

source: Of course, you can also use Test Pilot to provide feedback and suggestions to the teams behind each new feature.
pt_br: Claro, você também pode utilizar o Test Pilot para fornecer sua opinião e sugestão aos times por trás de cada nova funcionalidade.

source: [More info...](https://blog.mozilla.org/blog/2016/05/10/you-can-help-build-the-future-of-firefox-with-the-new-test-pilot-program/)
pt_br: [Mais informações...](https://blog.mozilla.org/blog/2016/05/10/you-can-help-build-the-future-of-firefox-with-the-new-test-pilot-program/)

source: Impact and Metrics
pt_br: Impacto e Métricas

source: Firefox is key to how Mozilla expresses its values and makes the Web increasingly exciting in the face of walled gardens like individual apps.
pt_br: O Firefox é a chave pelo qual a Mozilla expressa seus valores e faz a Web cada vez mais emocionante a frente de jardins murados como aplicativos individuais.

source: By testing new features and functionality, you help to keep Firefox on the leading edge and consumers engaged in our product.
pt_br: Ao testar os novos recursos e funcionalidades, você ajuda a manter o Firefox na linha de frente e os usuários envolvidos com nosso produto.

source: Additionally, it gives you a chance to go even deeper with specific feedback and ideas for Firefox.
pt_br: Adicionalmente, ele te dá a chance de se envolver fornecendo opiniões e ideias para o Firefox.

source: Goals for this area
pt_br: Objetivos para esta área

source: __Impact:__
pt_br: __Impacto:__

source: 500 Test Pilot add-on installs
pt_br: 500 instalações da extensão Test Pilot

source: __Strength:__
pt_br: __Força:__

source: 300 shares of Test Pilot link from the activity page
pt_br: 300 compartilhamentos do link para o Test Pilot vindos da página de atividade

source: 50 Discourse Posts
pt_br: 50 posts no Discourse

source: Audience for this activity
pt_br: Público para esta atividade

source: The audience this activity is anyone who is passionate about the Web and knows their way a little around Web browsers.
pt_br: O público dessa atividade é qualquer um que seja apaixonado pela Web e sabe um pouco sobre navegadores Web.

source: No programming skills are necessary.
pt_br: Nenhuma habilidade em programação é necessária.

source: It is for people who like to try new things and are not shy in telling us what they think.
pt_br: Esta atividade é para pessoas que gostam de tentar coisas novas e não tem medo de nos dizer o que pensam.

source: Activity Format
pt_br: Formato da atividade

source: While this activity can be run solo, we encourage you to run an event in your community to get together people to learn about testing experimental Firefox features and discuss what is upcoming in the browser.
pt_br: Você pode executar essa atividade sozinho, mas nós encorajamos você a realizar um evento em sua comunidade para reunir pessoas para aprender como testar os recursos experimentais do Firefox e o que está por vir no navegador.

source: We recommend a smaller, more informal event, such as a MozCoffee.
pt_br: Nós recomendamos um evento menor e mais informal, como um MozCoffee.

source: Event Flow
pt_br: Acompanhamento do evento

source: [Install Test Pilot](http://testpilot.firefox.com/experiments?utm_source=activity.mozilla.community%26utm_medium=referral%26utm_campaign=moz-community-2016)
pt_br: [Instalação do Test Pilot](http://testpilot.firefox.com/experiments?utm_source=activity.mozilla.community%26utm_medium=referral%26utm_campaign=moz-community-2016)

source: Enable and test features
pt_br: Ative e teste as funcionalidades

source: Provide feedback via the add-on
pt_br: Forneça sua opinião através da extensão

source: Start a discussion on [Discourse](https://discourse.mozilla-community.org/c/test-pilot)
pt_br: Inicie uma discussão no [Discourse](https://discourse.mozilla-community.org/c/test-pilot)

source: Output
pt_br: Após o evento

source: Additional to the recommended flow here are some things we’d like you, the event organizer, to do.
pt_br: Adicionalmente nós recomendamos a você, o organizador do evento, a fazer algumas coisas após o evento:

source: Fill out the post-event metrics on the event page you setup on the Reps portal
pt_br: Preencha as métricas de pós-evento na página que você criou no Portal de Reps

source: Tell us about how you got on.
pt_br: Nos conte como ocorreu.

source: What was your favourite new browser feature?
pt_br: Qual foi o seu novo recurso favorito no navegador?

source: [Test Pilot Discourse](https://discourse.mozilla-community.org/c/test-pilot)
pt_br: [Discourse sobre o Test Pilot](https://discourse.mozilla-community.org/c/test-pilot)

source: [Feedback about the activity specifically](https://discourse.mozilla-community.org/t/activate-mozilla-install-test-pilot/10075/1)
pt_br: [Opinião sobre a atividade especificamente](https://discourse.mozilla-community.org/t/activate-mozilla-install-test-pilot/10075/1)

source: Feel like doing more for Test Pilot?
pt_br: Vontade de fazer mais pelo Test Pilot?

source: Contributors are welcome to check out [our github repo](https://github.com/mozilla/testpilot/)
pt_br: Contribuidores são bem-vindos para conferir o [nosso repositório no GitHub](https://github.com/mozilla/testpilot/)

source: Here’s a [list of good first bugs](https://github.com/mozilla/testpilot/issues?q=is%3Aopen+is%3Aissue+label%3Agood-first-bug) if you would like to dive in
pt_br: Aqui está uma [lista de bons primeiros erros](https://github.com/mozilla/testpilot/issues?q=is%3Aopen+is%3Aissue+label%3Agood-first-bug), se você estiver afim de conferir

source: The [Test Pilot Wiki](https://wiki.mozilla.org/Test_Pilot) has lots of information about public meetings, communication and the Test Pilot roadmap
pt_br: A [Wiki do Test Pilot](https://wiki.mozilla.org/Test_Pilot) possui muitas informações sobre reuniões públicas, comunicação e um quadro de planejamento do Test Pilot
