Repository: mozilla/activate.mozilla.community
Catalog: locales/*/webcompat-sprint.xlf
Languages: pt_br

source: layout: page title: "Web Compatibility Sprint" permalink: /webcompat-sprint/ lang: en ref: webcompat-sprint parent: activities
pt_br: layout: page title: "Web Compatibility Sprint" permalink: /pt/webcompat-sprint/ lang: en ref: webcompat-sprint parent: activities

source: redirect_from: "/developer-engagement/webcompat-sprint/"
pt_br: redirect_from: "/pt/developer-engagement/webcompat-sprint/"

source: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 2-3 hours
pt_br: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 2-3 horas

source: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> At Mozilla, we want the web running well for everyone, not just in one or two browsers.
pt_br: {: .alert .alert-info .impactbox} <span class="glyphicon glyphicon-ok-circle" aria-hidden="true"></span> Na Mozilla, nós queremos a Web funcionando bem para todo mundo, não só em um ou dois navegadores.

source: This means cross-browser, user-agent independent, and cross-device.
pt_br: Isso significa entre diferentes navegadores, user-agent indepentende e dispositivos distintos.

source: Web Compatibility, the ability for all Web content to run in all browsers, is important.
pt_br: A Compatibilidade Web, a capacidade de todo conteúdo da Web ser executado em todos os navegadores, é importante.

source: There are multiple web content engines running on multiple devices, and sometimes with a little testing and some small tweaks to their site, developers can ensure that more users can have the full experience that is desired.
pt_br: Existem vários motores de conteúdo web que funcionam em vários dispositivos, e às vezes com um pouco de testes e alguns pequenos ajustes em seu site, desenvolvedores podem garantir que mais usuários possam ter a experiência completa que é desejada.

source: For more background and data on Web Compatibility, read the [recent blog post on Mozilla Hacks](https://hacks.mozilla.org/2016/07/make-the-web-work-for-everyone/).
pt_br: Para mais informações e dados sobre Compatibilidade Web, leia o [post sobre compatilidade entre navegadores no blog Mozilla Hacks](https://hacks.mozilla.org/2016/07/make-the-web-work-for-everyone/).

source: Impact and Metrics
pt_br: Impacto e Métricas

source: At Mozilla, we want the web running well for everyone, not just in one or two browsers.
pt_br: Na Mozilla, queremos que a Web funcione bem para todos, não apenas em um ou dois navegadores.

source: This means cross-browser, and cross-device.
pt_br: Isto significa entre diferentes navegadores e dispositivos distintos.

source: Our global community can give visibility to this that no team could ever match!
pt_br: Nossa comunidade global pode dar a visibilidade que nenhum outro time faria!

source: Goals for this area
pt_br: Objetivos para esta área

source: __Impact:__
pt_br: __Impacto:__

source: 300 Add-on installs
pt_br: 300 extensões instaladas

source: 200 compatibility issues filed
pt_br: 200 Problemas de compatibilidade arquivados

source: 50 Mozillians run events
pt_br: 50 Mozillians organizando eventos

source: 50 signups to the [compatibility list](https://www.mozilla.org/en-US/about/forums/#compatibility)
pt_br: 50 assinaturas na [lista de compatibilidade](https://www.mozilla.org/en-US/about/forums/#compatibility)

source: Audience for this activity
pt_br: Público para esta atividade

source: The audience this activity is anyone who is passionate on the topic, but being somewhat Web tech savvy is a help.
pt_br: O público-alvo desta atividade é qualquer um que seja apaixonado pelo tema, mas ser um "técnico" web é de grande ajuda.

source: No programming skills are necessary.
pt_br: Nenhuma habilidade em programação é necessária.

source: It is for people who care about diversity on the Web.
pt_br: É para pessoas que se preocupam com a diversidade na Web.

source: Activity Format
pt_br: Formato da atividade

source: While this activity can be run solo, we encourage you to run an event in your community to get together people who care about the Web.
pt_br: Você pode realizar essa atividade sozinho, mas nós encorajamos você a organizar um evento em sua comunidade para reunir as pessoas que se preocupam com a Web.

source: The goal is to test sites, diagnose problems, and discuss how to evangelise locally to developers about a Web that works for everyone.
pt_br: O objetivo é testar sites, diagnosticar problemas e discutir como evangelizar os desenvolvedores locais sobre uma Web que funcione para todos.

source: Put an event team together
pt_br: Inicie uma equipe para organização do evento

source: Choose a date and secure a venue
pt_br: Escolha uma data e local seguro

source: Setup the event on Reps Portal ([instructions](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting))
pt_br: Crie um evento no Portal de Reps ([instruções](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting))

source: For duration, we recommend a half-day (or full evening) event with a minimum of 10-15 attendees.
pt_br: Para duração, recomendamos um evento de meio-dia (ou uma noite inteira), com um mínimo de 10-15 participantes.

source: Event Flow
pt_br: Acompanhamento do evento

source: Set yourself up with Firefox.
pt_br: Prepare-se com o Firefox.

source: Any or all of the following versions:
pt_br: Qualquer uma ou todas as seguintes versões:

source: [Firefox for Android](https://www.mozilla.org/firefox/channel/)
pt_br: [Firefox para Android](https://www.mozilla.org/firefox/channel/)

source: [Firefox for iOS](https://www.mozilla.org/firefox/ios/)
pt_br: [Firefox para iOS](https://www.mozilla.org/firefox/ios/)

source: [Install the Webcompat.com Reporter add-on](https://addons.mozilla.org/addon/webcompatcom-reporter?src=external-activatewebcompat1)
pt_br: [Instale a extensão Webcompat.com Reporter](https://addons.mozilla.org/addon/webcompatcom-reporter?src=external-activatewebcompat1)

source: No add-ons support for iOS, but people can report bugs manually at [webcompat.com](https://webcompat.com)
pt_br: Nenhuma extensão tem suporte no iOS, mas as pessoas podem reportar manualmente em [webcompat.com](https://webcompat.com)

source: Choose the sites you want to test
pt_br: Escolhe os sites que você quer testar:

source: We recommend the top sites in your country, as measured by a reputable local source or using the [Alexa Top Sites by Country](http://www.alexa.com/topsites/countries) reference
pt_br: Nós recomendamos a lista disponível em Alexa Top 500 sites - global ou por país.

source: Test and Report!
pt_br: Teste e Reporte!

source: Pay special attention to what we are looking for [in reported issues](https://wiki.mozilla.org/Compatibility/Guide#Reporting_a_Web_compatibility_issue)
pt_br: Atenção especial para o que estamos procurando em [problemas reportados](https://wiki.mozilla.org/Compatibility/Guide#Reporting_a_Web_compatibility_issue)

source: If you want to become an expert in web compatibility, [go here](https://wiki.mozilla.org/Compatibility/Guide)
pt_br: Se você encontrar algo no site que não está sendo apresentado ou funcionando corretamente, então clique no botão da extensão e siga os passos para reportar.

source: Output
pt_br: Após o evento

source: In addition to the recommended event flow here are some things we’d like you, the event organizer, to do.
pt_br: Adicionalmente nós recomendamos algumas coisas a fazer após o evento:

source: Fill out the post-event metrics on the event page you setup on the Reps portal
pt_br: Preencha as métricas de pós-evento na página que você criou no Portal de Reps

source: Optionally, tell us about your event.
pt_br: Opcionalmente, conte-nos sobre o seu evento.

source: This can be before or after.
pt_br: Isto pode ser antes ou depois.

source: We love to hear about upcoming plans, and of course love to hear about what was achieved at the event with a picture or two!
pt_br: Gostamos de ouvir sobre os próximos planos, e, claro, adorarímos ouvir sobre o que foi alcançado no evento com uma imagem ou duas!

source: [Here is the Discourse post to write to](https://discourse.mozilla-community.org/t/activate-mozilla-web-compatibility-sprint/10074/1)
pt_br: [Aqui está o post no Discourse para você nos contar sua experiência](https://discourse.mozilla-community.org/t/activate-mozilla-web-compatibility-sprint/10074/1)

source: Encourage attendees who want to continue to work on Web Compat to sign up to the [mailing list](https://www.mozilla.org/en-US/about/forums/#compatibility)
pt_br: Incentive os participantes que querem continuar trabalhando com compatibilidade web a se inscrever na [lista de email](https://www.mozilla.org/en-US/about/forums/#compatibility)

source: While the focus of this activity should be on testing sprints, there are other ways to stay more involved with the community after.
pt_br: Embora o foco desta atividade seja em sprints de teste, existem outras maneiras de ficar mais envolvido com a comunidade depois.

source: Site outreach: This is about trying to get in contact with websites that have issues and (politely!) providing ways that they can improve compatibility or fix their bugs.
pt_br: Diagnóstico de erro: Este é sobre a tentativa de compreender as questões estão por trás relatórios de erros, e, se possível, fornecer sugestões de correções para os proprietários do site. Mais informações

source: [More information](https://github.com/mozilla/participation-org/issues/237#issuecomment-163632626)
pt_br: [Mais informações](https://github.com/mozilla/participation-org/issues/237#issuecomment-163632626)
