Repository: mozilla/activate.mozilla.community
Catalog: locales/*/webvr-camp.xlf
Languages: pt_br

source: layout: page title: "WebVR Camp" permalink: /webvr-camp/ lang: en ref: webvr-camp parent: activities
pt_br: layout: page title: "WebVR Camp" permalink: /pt/webvr-camp/ lang: en ref: webvr-camp parent: activities

source: redirect_from: "/developer-engagement/webvr-camp/"
pt_br: redirect_from: "/pt/developer-engagement/webvr-camp/"

source: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 3-4 hours
pt_br: {: .label .timebox} <span class="glyphicon glyphicon-time" aria-hidden="true"></span> 3-4 horas

source: [A-Frame](https://aframe.io/) is a web framework for building virtual reality experiences, making it easy for anyone to get involved with virtual reality.
pt_br: [A-Frame](https://aframe.io/) é um framework web para a construção de experiências de realidade virtual, tornando mais fácil para que todos possam se envolver com a realidade virtual.

source: Its goal is to onboard developers into 3D and advance WebVR, an open platform for virtual reality that leverages the Web.
pt_br: O objetivo é apresentar aos desenvolvedores sobre 3D e promover o WebVR, uma plataforma aberta para a realidade virtual que irá alavancar a Web.

source: __Having more developers and content creators playing with WebVR is important for the future of virtual reality to help build towards a free and open virtual reality platform not owned by any individual entity__.
pt_br: __Ter mais desenvolvedores e criadores de conteúdo que usam o WebVR é importante para o futuro da realidade virtual, para ajudar a construir uma plataforma de realidade virtual livre e aberta não proprietária de qualquer entidade individual__.

source: A-Frame is used extensively by the Mozilla VR team to prototype and experiment with WebVR.
pt_br: A-Frame é amplamente utilizado pela equipe Mozilla VR para prototipação e experimentos com WebVR.

source: __Having more contributors know A-Frame will give them a chance to get involved in one of the most exciting revolutions in the field of technology__.
pt_br: __Ter mais colaboradores que conheçam A-Frame, dará a eles a chance de se envolver em uma das revoluções mais emocionantes no campo da tecnologia__.

source: Impact and Metrics
pt_br: Impacto e Métricas

source: Goals for this area
pt_br: Metas

source: __Impact:__
pt_br: __Impacto:__

source: 200 people signed up to the [A-Frame Slack channel](https://aframe.io/community/#a-frame)
pt_br: 200 pessoas se inscreveram no [canal Slack do A-Frame](https://aframe.io/community/#a-frame)

source: 100 projects built in or for A-Frame
pt_br: 100 projetos construídos em ou para o A-Frame

source: 20 blog posts about events, activities, experiences, projects, or tutorials.
pt_br: 20 posts sobre eventos, atividades, experiências, projetos ou tutoriais.

source: 500 social shares with #MozActivate, #WebVRCamp, @aframevr, @mozillavr
pt_br: 500 ações sociais com #MozActivate, #WebVRCamp, @aframevr, @mozillavr

source: __Strength:__
pt_br: Força:__

source: 20 Mobilizers activated
pt_br: 20 mobilizadores ativada

source: 30 events
pt_br: 30 eventos

source: 400 people are introduced to and starting to build with A-Frame
pt_br: 400 pessoas são introduzidas e começam a construir com A-Frame

source: Audience for this activity
pt_br: Público para esta atividade

source: Your audience for this event should be anyone interested in virtual reality including web developers, designers and students.
pt_br: Seu público para este evento deve ser alguém interessado em realidade virtual, incluindo desenvolvedores web, designers e estudantes.

source: The audience should have a basic grasp of HTML.
pt_br: O público deve ter uma compreensão básica de HTML.

source: Activity Format
pt_br: Formato de Atividade

source: Help us build community around the A-Frame library by conducting a mobilizing / learning event for 20-30 contributors.
pt_br: Ajude-nos a construir uma comunidade em torno da biblioteca A-Frame através da realização de um evento mobilizador / aprendizagem por 20-30 contribuidores.

source: **2-4 Weeks Before the Event**
pt_br: **2-4 semanas antes do evento**

source: Put an event team together
pt_br: Coloque uma equipe de evento juntos

source: Choose a date and secure a venue
pt_br: Escolha uma data e garanta um local

source: Setup the event on Reps Portal ([instructions](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting)).
pt_br: Configuração do evento no portal dos Reps [(instruções)](https://wiki.mozilla.org/ReMo/SOPs/Event_hosting).

source: [Find a Rep](https://reps.mozilla.org/people/) closeby to do this if you are not one.
pt_br: [Encontrar um Rep](https://reps.mozilla.org/people/) na vizinhança para fazer isso se você não for um.

source: Give a thought whether it will be self-facilitated or with someone who has A-Frame experience.
pt_br: Dê um pensamento se vai ser auto-facilitada ou com alguém que tem experiência de A-Frame.

source: You can find help on the [Mozilla VR Telegram group](https://telegram.me/MozillaVR) or the [A-Frame Slack channel](https://aframevr-slack.herokuapp.com/)
pt_br: Você pode encontrar ajuda sobre o grupo [Mozilla VR Telegram](https://telegram.me/MozillaVR) ou o [canal Slack A-Frame](https://aframevr-slack.herokuapp.com/)

source: Create an event page on a platform popular in your locale, such as Facebook or Meetup.com, and keep posting interesting information about WebVR &
pt_br: Crie uma página do evento em uma plataforma popular em sua localidade, como o Facebook ou o Meetup.com, e continuar a postar informações interessantes sobre WebVR &

source: related topics to keep continue the conversation
pt_br: tópicos relacionados para manter continuar a conversa

source: Download and customize the [A-Frame Presentation Kit](https://github.com/aframevr/aframe-presentation-kit)
pt_br: Faça o download e personalizar a [Apresentação Kit A-Frame](https://github.com/aframevr/aframe-presentation-kit)

source: Create a few scenes for demo &
pt_br: Crie algumas cenas para fins de

source: prototyping purposes.
pt_br: demonstração e protótipos.

source: You can find examples on [awesome-aframe](https://github.com/aframevr/awesome-aframe)
pt_br: Você pode encontrar exemplos de [incríveis-aframe](https://github.com/aframevr/awesome-aframe)

source: Acquire headsets to use and demo.
pt_br: Adquirir fones de ouvido para uso e demonstração.

source: Google Cardboard can be acquired in some locations for less than $5 a set.
pt_br: Google cartão pode ser adquirido em alguns locais por menos de US $ 5 por set.

source: We recommend 5 headsets for an event of 20-30 people.
pt_br: Recomendamos 5 headsets para um evento de 20-30 pessoas.

source: You can request budget of up to $50 maximum for these headsets but you will have to buy them yourself.
pt_br: Você pode solicitar orçamento de até US $ 50 máximo para esses fones de ouvido, mas você terá que comprá-los você mesmo.

source: **1 Week Before the Event**
pt_br: **1 Semana Antes do Evento**

source: Confirmed selected attendees through email.
pt_br: Confirmados participantes selecionados através de e-mail.

source: Distribute the following list of tasks to do before event:
pt_br: Distribua a seguinte lista de tarefas para fazer antes do evento:

source: Create a GitHub account if they don’t have one
pt_br: Crie uma conta GitHub, se eles não têm um

source: Get familiar with [A-Frame](https://aframe.io/) and [read about areas to contribute](https://github.com/aframevr/aframe/blob/master/CONTRIBUTING.md)
pt_br: Familiarize-se com [A-Frame](https://aframe.io/) e ler [sobre áreas para contribuir](https://github.com/aframevr/aframe/blob/master/CONTRIBUTING.md)

source: Join the [A-Frame Slack Channel](https://aframevr-slack.herokuapp.com/)
pt_br: Junte-se à [A-Frame Slack Channel](https://aframevr-slack.herokuapp.com/)

source: [Optional] Play with A-Frame, starting with a [Hello World scene](https://codepen.io/mozvr/pen/BjygdO).
pt_br: [Opcional] Jogue com A-Frame, começando com um [Olá Mundo cena](https://codepen.io/mozvr/pen/BjygdO).

source: Skim through the [documentation](https://aframe.io/docs/0.3.0/introduction/getting-started.html).
pt_br: Folhear a [documentação](https://aframe.io/docs/0.3.0/introduction/getting-started.html).

source: Event Flow
pt_br: Fluxo de Eventos

source: This is how you can break up a 4 hour event format.
pt_br: Isto é como você pode acabar com um formato de evento de 4 horas.

source: You can try to shorten some sections if you want to do it quicker.
pt_br: Você pode tentar encurtar algumas seções se você quiser fazê-lo mais rápido.

source: **Getting Started (30 minutes)**
pt_br: **Iniciação (30 minutos)**

source: Introduction of speakers and attendees with an ice breaker session (e.g., [catch the ball](http://businessmajors.about.com/od/icebreakers/a/Icebreaker8.htm))
pt_br: Introdução de palestrantes e participantes com uma sessão de disjuntor de gelo (por exemplo, [pegar a bola](http://businessmajors.about.com/od/icebreakers/a/Icebreaker8.htm))

source: About [Mozilla’s mission](https://www.mozilla.org/mission/) as a non-profit and community-focused organization.
pt_br: Sobre [missão da Mozilla](https://www.mozilla.org/mission/) como um sem fins lucrativos e organização focada na comunidade.

source: About [VR, WebVR &
pt_br: Sobre [VR, WebVR &

source: Quickly note social tags: #MozActivate, #WebVRCamp, @mozillavr
pt_br: Nota rapidamente marcas sociais: #MozActivate, #WebVRCamp, @mozillavr

source: **A-Frame [Concepts](https://aframe.io/docs/0.3.0/introduction/) (30 minutes)**
pt_br: **A-Frame [Conceitos](https://aframe.io/docs/0.3.0/introduction/) (30 minutos)**

source: [Demo](http://aframe.io/examples) of basic A-Frame scenes &
pt_br: [Demo](http://aframe.io/examples) de cenas e aplicativos básicos do

source: apps.
pt_br: um-quadro.

source: More examples at [A Week of A-Frame](https://aframe.io/blog/)
pt_br: Mais exemplos em [A Semana de A-Frame](https://aframe.io/blog/)

source: Show off [A-Painter](https://blog.mozvr.com/a-painter/)
pt_br: Demo [A-Painter](https://blog.mozvr.com/a-painter/)

source: Introduce HTML tags.
pt_br: Introduzir tags HTML.

source: If audience is more technical, also introduce the [entity-component-system pattern](https://aframe.io/docs/0.3.0/introduction/#entity-component-system)
pt_br: Se público é mais técnico, também introduzir a [padrão em componentes do sistema entidade](https://aframe.io/docs/0.3.0/introduction/#entity-component-system)

source: **Time to Hack (1 hour)**
pt_br: **Tempo para Hack (1 hora)**

source: Propose your idea of VR experiences to build
pt_br: Propor a sua ideia de experiências de RV para construir

source: Can get started with [Codepen](http://codepen.io/mozvr/pen/BjygdO) or the [Boilerplate](https://github.com/aframevr/aframe-boilerplate)
pt_br: Pode começar com [Codepen](http://codepen.io/mozvr/pen/BjygdO) ou [clichê](https://github.com/aframevr/aframe-boilerplate)

source: For the boilerplate, we recommend using a local server such as [Mongoose](https://www.cesanta.com/products/binary) or through Node.js.
pt_br: Para o clichê, é recomendável usar um servidor local como [Mongoose](https://www.cesanta.com/products/binary) ou através Node.js.

source: **More About A-Frame (30 minutes)**
pt_br: **Mais sobre A-Frame (30 minutos)**

source: A-Frame in depth (e.g., demo of advanced scenes, how are they built, using community components)
pt_br: A-Frame em profundidade (por exemplo, demo de cenas avançados, como eles são construídos, utilizando componentes da comunidade)

source: ** Continue Hacking (1 hour)**
pt_br: **Continue Hackeando (1 hora)**

source: Improve your VR experience or build something else using more advanced concepts
pt_br: Melhorar a sua experiência de VR ou construir outra coisa usando conceitos mais avançados

source: **Review &
pt_br: **Rever &

source: Planejar (30 minutos)**
pt_br: Plano (30 minutes)**

source: Review the whole event
pt_br: Rever todo o evento

source: Talk about [A-Frame community](http://aframe.io/community/).
pt_br: Fale sobre [comunidade A-Frame](http://aframe.io/community/).

source: Don’t forget to mention if you have a separate communication medium to connect with the local WebVR community (e.g., WebVR-India telegram group)
pt_br: Não se esqueça de mencionar se você tem um meio de comunicação em separado para se conectar com a comunidade WebVR local (por exemplo, WebVR-India grupo telegrama)

source: Discuss takeaways
pt_br: Discutir delivery

source: Discuss individual action plans and follow-up plans
pt_br: Discutir planos de acção individuais e planos de acompanhamento

source: Output
pt_br: Saída

source: Additional to the recommended event flow here are some things we’d like you, the event organizer, to do.
pt_br: Adicional para o fluxo de eventos recomendado aqui estão algumas coisas que gostaríamos que você, o organizador do evento, para fazer.

source: Fill out the post-event metrics on the event page you set up on the Reps portal
pt_br: Preencha as métricas pós-evento na página do evento você configurar no portal Reps

source: Thank-You email to attendees with:
pt_br: Enviar um e-mail de obrigado para os participantes com:

source: A feedback form
pt_br: Um formulário de feedback

source: Suggestion to Tweet their experience.
pt_br: Sugestão de tweet sua experiência.

source: Mention @mozillavr, #MozActivate, and #WebVRCamp
pt_br: Mencione @mozillavr, #MozActivate e #WebVRCamp

source: Suggestion to write a blog post and share
pt_br: Sugestão para escrever um post de blog e compartilhar

source: Important links
pt_br: Links importantes

source: Send an event report or blog post and photo-stream link either over Twitter or Slack.
pt_br: Enviar um relatório de evento ou blog e link de foto-stream, quer através do Twitter ou Slack.

source: Share a summary [this Discourse thread](https://discourse.mozilla-community.org/t/activate-mozilla-webvr-camp/11190)
pt_br: Compartilhe sua experiência neste [tópico no Discourse](https://discourse.mozilla-community.org/t/activate-mozilla-webvr-camp/11190)

source: Contact
pt_br: Contato

source: Want to find out more about the A-Frame community?
pt_br: Quer saber mais sobre a comunidade de A-Frame?

source: Ping us on the [A-Frame Slack channel](https://aframevr-slack.herokuapp.com/) or Tweet at us [@aframevr](https://twitter.com/aframevr).
pt_br: O ping-nos no canal [Slack A-Frame](https://aframevr-slack.herokuapp.com/) ou Tweet para nós []@aframevr](https://twitter.com/aframevr).

source: Visit the [A-Frame community page](https://aframe.io/community/) for more details.
pt_br: Visite a página da [comunidade A-Frame](https://aframe.io/community/) para mais detalhes.
